// Задание 42 №1
// const PI = 3.14;
// r=5;
// alert(2*PI*r);



// Задание 43 №1
// let a = '5' + '2';
// alert(a);

// Задание 43 №2
// let a = '5' + 2;
// alert(a);

// Задание 43 №3
// let a = 5 + '2';
// alert(a);

// Задание 43 №4
// let a = 5 + 2;
// alert(a);

// Задание 43 №5
// let a = '5' * '2';
// alert(a);

// Задание 43 №6
// let a = '5' - '2';
// alert(a);

// Задание 43 №7
// let a = '5' / '2';
// alert(a);

// Задание 43 №8
// let a = '5' % '2';
// alert(a);

// Задание 43 №9
// let a = '5s' * '2';
// alert(a);

// Задание 43 №10
// let a = '5s' + '2';
// alert(a);

// Задание 43 №11
// let a = (-'5') + (-'2');
// alert(a);

// Задание 43 №12
// let a = '5' * 1 + '2' * 1;
// alert(a);

// Задание 43 №13
// let a = '5' * '1' + '2' * '1';
// alert(a);

// Задание 43 №14
// let a = '' + 3 + 1;
// alert(a);





// Задание 44 №1
// let a44 = Number('10'); 
// let b44 = Number('20'); 
// alert(a44 + b44); 

// Задание 44 №2
// alert( Number('2') + Number('3') );

// Задание 44 №3
// alert( 2 + Number('3') );

// Задание 44 №4
// alert( '2' + Number('3') );



// Задание 45 №1
let a = '2';
let b = '3';
alert(+a + +b);